{
  "siteTitle": "Casey Callow",
  "siteDescription": "Designer, prototyper, maker.",
  "fontSrc": "https://fonts.googleapis.com/css?family=Armata|Open+Sans",
  "mainPage": {
    "chatbotSrc": "https://api.motion.ai/webchat/23723?sendBtn=SEND&inputBox=Type+something...&token=ef7a260569f0f1fa64203a3f32fcd87e",
    "prototypeVideos": false,
    "mainActive": true
  },
  "portfolioPage": {
    "chatbotSrc": "https://api.motion.ai/webchat/34296?sendBtn=SEND&inputBox=Type+something...&token=daadf986ccf2824df69b3ad2ebb3542a",
    "prototypeVideos": true,
    "portfolioActive": true
  },
  "about": {
    "title": "Casey Callow is a product designer, prototyper, and UX engineer with an affinity for design systems.",
    "description": "He also feels weird referring to himself in the third person, so he did something even weirder: built a chatbot to let you pretend to talk to him."
  },
  "navBar": {
    "label": "Casey Callow",
    "imgSrc": "assets/profile-pic.png"
  },
  "iconWifi": [
    {
      "icon": "wifi"
    }
  ],
  "iconBattery": [
    {
      "icon": "battery"
    }
  ],
  "iconClose": [
    {
      "icon": "close"
    }
  ],
  "socialLinks": [
    {
      "src": "https://twitter.com/caseycallow",
      "icon": "twitter"
    },
    {
      "src": "mailto:hello@caseycallow.design",
      "icon": "gmail"
    },
    {
      "src": "https://www.linkedin.com/in/caseycallow/",
      "icon": "linkedin"
    },
    {
      "src": "https://medium.com/@caseycallow",
      "icon": "medium"
    },
    {
      "src": "http://codepen.io/caseycallow",
      "icon": "codepen"
    },
    {
      "src": "https://dribbble.com/caseycallow",
      "icon": "dribbble"
    },
    {
      "src": "https://github.com/caseycallow",
      "icon": "github"
    }
  ],
  "prototypeVideo": [
    {
      "class": "book-reviews",
      "src": "https://player.vimeo.com/video/200289904?autoplay=1&loop=1&title=0&byline=0&portrait=0"
    },
    {
      "class": "time-tracker",
      "src": "https://player.vimeo.com/video/200289219?autoplay=1&loop=1&title=0&byline=0&portrait=0"
    },
    {
      "class": "wardrobe-mgmt",
      "src": "https://player.vimeo.com/video/200288005?autoplay=1&loop=1&title=0&byline=0&portrait=0"
    },
    {
      "class": "restaurant-finder",
      "src": "https://player.vimeo.com/video/198791350?autoplay=1&loop=1&title=0&byline=0&portrait=0"
    }
  ],
  "teaser": [
    {
      "title": "Deployment Dashboard",
      "description": "A deployment tool for developers and project managers to create, configure, and monitor new services and applications.",
      "overview": "Developers at a major academic journal company had no standardized or simple way to launch and configure services/applications for their company. Developers were spending lots of time setting up Github repos and managing configuration settings rather than focusing on development. Management needed a way to check the status of the product line. Our solution was to build a dashboard that aided in easy creation/configuration of new apps and services, and allow for a high-level view of the availability of all applications.",
      "role": "Lead designer, sketching, user research, creating mockups, prototyping in the browser using PatternLab, and delivering production HTML and CSS to be converted into Angular application.",
      "tools": "Whiteboard, Sketch, PatternLab, Sass, Mustache, jQuery, Gulp",
      "body": [
        {
          "paragraph": "After speaking with several developers to understand the scope of the project, it became clear we had two main users that would be using the application: developers and managers. Developers needed a top down view, configuration options, settings, and power features. Managers would only usually need a top down view. It made sense to focus the app around the area where both user goals intersected, so I began thinking about the landing page."
        },
        {
          "paragraph": "The landing page needed to serve one goal: provide a high-level summary of the availability state (either available or unavailable) of a list of apps. A card based layout would provide room for a status component, title, meta data, and any action link we might need."
        },
        {
          "image": [
            {
              "src": "assets/dashboard/dashboard-mock-home.jpg",
              "alt": "Dashboard mockup",
              "caption": "Stubbing out what a card based layout might look like."
            }
          ]
        },
        {
          "image": [
            {
              "src": "assets/dashboard/dashboard-mock-cards.png",
              "alt": "Card component concepts",
              "caption": "Early explorations for the status card component."
            }
          ]
        },
        {
          "paragraph": "Early iterations contained a “deploy” button on the card itself. But after some feedback, we decided this was a more deliberate action that should be contained inside the configuration page. Instead, it was replaced with a link that pointed to the URL of the app itself. I opted for a dark UI to blend in with the tools developers were already using, and hopefully increase adoption."
        },
        {
          "paragraph": "After building out the dashboard page I started thinking about the configuration options and the best way to display a growing list of controls. Part of the challenge was that the amount of options was in flux and I had very little requirements to latch onto, so the design needed to be dynamic and scalable. Tabbed navigation was the best way to do this because the tab list could easily grow as more settings were added."
        },
        {
          "image": [
            {
              "src": "assets/dashboard/dashboard-sketch.jpg",
              "alt": "Whiteboard sketch of UI",
              "caption": "What should the workflow look like? Does this UI support the goals of the user?"
            },
            {
              "src": "assets/dashboard/dashboard-mock-layouts.png",
              "alt": "UI iterations for detail page",
              "caption": "UI iterations for detail page."
            },
            {
              "src": "assets/dashboard/dashboard-sketch-spec.jpg",
              "alt": "Whiteboard sketch of UI with component names",
              "caption": "Atomic design. Breaking each element down into modular components before coding it up in the browser."
            }
          ]
        },
        {
          "paragraph": "The dashboard was designed to feel like a single page app with a flat information hierarchy. Both the creation form and the detail overlay controls slide over the dashboard page without completely obscuring it where clicking outside the panel dismisses it. I struggled with several ideas before landing on this. Should the app detail go to a new page? If it doesn't, how do I create a sense of layering without making it a modal? Does it work on a phone? Eventually, I landed on this drawer-style UI which eliminated the need for any signposting “you are here” UI, and back button, or page reloading by creating a strong sense of vertical layering. I also knew our Angular developers would be able to update any page component without fully refreshing the page."
        },
        {
          "paragraph": "At this point, I had a clear enough idea to start designing in the browser using PatternLab. Jumping into code early and not restricting myself to a set 'whiteboard -> mockup -> code' process allowed for the flowing of creative ideas and the ability to validate design decisions quickly. I could now test how the design held up on different browser widths and devices, and start introducing animation and state to the UI."
        },
        {
          "paragraph": "Getting into code earlier also meant our developers could start hooking up the UI to the API faster, even though it wasn't fully complete. As I built features and components, the team would update the production app, and we could see the final product take shape much faster than if we had taken a more waterfall-like approach."
        },
        {
          "image": [
            {
              "src": "assets/dashboard/dashboard-home.png",
              "alt": "Dashboard homepage",
              "caption": "Final implementation of homepage."
            },
            {
              "src": "assets/dashboard/dashboard-create.png",
              "alt": "Dashboard homepage",
              "caption": "The slide over panel to create a new application."
            },
            {
              "src": "assets/dashboard/dashboard-detail.png",
              "alt": "Dashboard homepage",
              "caption": "The detail page with options to deploy, delete, and configure a number of options."
            }
          ]
        },
        {
          "video": [
            {
              "src": "https://player.vimeo.com/video/209667278?autoplay=1&loop=1&title=0&byline=0&portrait=0"
            }
          ]
        },
        {
          "paragraph": "The major challenge I faced during this project was operating with very loose requirements. Many assumptions had to be made in the absence of strict user needs, and I often found myself designing with data that would be out of date in a few days. This forced me to iterate more frequently and not grow attached to specific UI solutions. Sometimes the only tangible data I would have to work with was a JSON object. However, designing and coding the UI layer in parallel with API development meant I was collaborating incredibly closely with the dev team and building a deeper understanding of the system, which ultimately led to a better product."
        }
      ]
    },
    {
      "title": "Proposal Builder",
      "description": "A system to streamline the creation of funding proposals for job creation and a stronger California economy.",
      "overview": "We worked with a program associated the California Community Colleges to help streamline the process of creating, distributing, and tracking funding proposals for new grants and educational resources. Most of the proposal creation process was happening either offline or using free online tools, so keeping track of proposal data was nearly impossible. The state needed this data in order to monitor the success of collegiate programs to more appropriately allocate resources, and to hopefully prepare our future workforce for emerging job demands.",
      "role": "Design strategy, UI design, prototyping, HTML/CSS.",
      "tools": "Whiteboard, Sketch, PatternLab, Sass (BEM), Mustache, jQuery, Gulp",
      "body": [
        {
          "paragraph": "This was easily the most complex project I've ever had the pleasure of working on. Working with a small team, we had roughly 2 months to build an MVP UI showcasing the proposal creation process. In the beginning, a lot of our time was spent simply trying to wrap our heads around the problem, and all the details and considerations involved."
        },
        {
          "image": [
            {
              "src": "assets/proposal/proposal-whiteboard.jpg",
              "alt": "Whiteboard with ideas and UI sketches",
              "caption": "Trying to figure how to organize the overwhelming complexity."
            }
          ]
        },
        {
          "paragraph": "We approached early UI concepts around the idea of breaking down the UI into manageable chunks, and separating each step into its own area."
        },
        {
          "image": [
            {
              "src": "assets/proposal/proposal-wireframe.jpg",
              "alt": "",
              "caption": "Early layout concept."
            }
          ]
        },
        {
          "image": [
            {
              "src": "assets/proposal/proposal-description.jpg",
              "alt": "",
              "caption": "Description page."
            }
          ]
        },
        {
          "image": [
            {
              "src": "assets/proposal/proposal-budget.jpg",
              "alt": "",
              "caption": "Budget page."
            }
          ]
        },
        {
          "image": [
            {
              "src": "assets/proposal/proposal-metrics.jpg",
              "alt": "",
              "caption": "Metrics page."
            }
          ]
        },
        {
          "video": [
            {
              "src": "https://player.vimeo.com/video/210014070?autoplay=1&loop=1&title=0&byline=0&portrait=0"
            }
          ]
        }
      ]
    },
    {
      "title": "Restaurant Finder",
      "description": "Description for the project goes right here."
    }
  ]
}
